{
  "id": "LazyCowboy.MoreSlugcatsNerfs",
  "name": "MoreSlugcats Nerfs",
  "version": "1.1.0",
  "authors": "LazyCowboy",
  "description": "A mod that balances the Downpour slugcats to be less OP whilst adding some fun new mechanics to keep things fun. ALL of these changes can be totally disabled in the mods's config menu (or modified to your liking). Since its initial release, this mod has grown to encompass many ideas for slugcat nerfs, several of which you may dislike. That's fine! Disable or tweak them to your liking!<LINE>Ever felt like Gourmand creating life was a little unrealistic? Or Artificer is totally over-powered and not fun? Or Rivulet gets too easy after taking the Cell? Or Saint's tongue shouldn't launch you so high? Well, this mod fixes all of that!<LINE><LINE>UPDATE 1.1.0: Rain Meadow compatibility!<LINE>Not that Meadow compatibility matters too much. Really, all this does is prevent you from using this mod as a \"cheat.\"<LINE>Yeah, sorry, no more cheating.<LINE><LINE>Gourmand:<LINE>* Gourmand moves 10% faster when on an empty stomach (but gets exhausted 10% more quickly) (configurable).<LINE>* Crafting Nerfs: Gourmand can no longer create life or void-powered explosives.<LINE>* Gourmand's slide speed is reduced slightly (0.8x) (configurable in the config menu).<LINE>* Gourmand's spears deal 0.8x damage than usual. You can alter this number to your pleasure in the config menu.<LINE>* Gourmand becomes exhausted 10% faster when at 0 food pips, lessening as Gourmand consumes more food. (Additionally, Gourmand's overall rate of exhaustion can be configured, but is unchanged by default.)<LINE>(Gourmand has minimal changes that don't affect his gameplay much, except it'll be harder to kill the red centipede.)<LINE><LINE>Artificer:<LINE>* Movement speed is slightly reduced (0.9x) (configurable).<LINE>* Scavenger population is 50-60% of what it previously was, making things easier. (Alternatively, you can increase the population).<LINE>* Crafting explosives now costs twice as much food (but only requires 1 pip).<LINE>* Artificer's explosion jumps are less powerful (0.8x), restraining mobility slightly. Or you can increase the explosion power...<LINE>* Explosion jumps and parries reduce your food by a quarter-pip (configurable) (optionally can make this required to explosion jump).<LINE>* Parries now count as two explosion jumps towards the explosion counter.<LINE>* Being stunned by explosions causes Artificer to overheat (configurable).<LINE>* Scavengers are worth half as much food in Artificer's campaign (only 2 pips) (configurable). This encourages the player to find other food sources.<LINE>* Artificer's spear throws can now be angled up to 25 degrees (configurable)! Now you can stab scavs slightly above or below you!<LINE>* (Artificer's throwing ability can be optionally configured.)<LINE>* Artificer's spear throws are significantly slower in arena mode only (configurable).<LINE>* For quality-of-life, Artificer's second ending can be obtained after the first one on the same save file now (configurable). (Note: Works by resetting all echo progress upon achieving the first ending (so echoes can be revisited). Makes visiting echoes still grant karma.)<LINE>(Artificer's absurdity was what prompted this mod to be made. I reduced her powers but also her threats (scavs), and gave her the unique ability to fight back against scavs better by angling spear throws.)<LINE><LINE>Rivulet:<LINE>* Rivulet's land movement speed is decreased (0.8x) (configurable).<LINE>* Rivulet's spear throwing ability and damage is reduced to be identical to Monk's.<LINE>* Rivulet's slide speed is slightly decreased (0.8x) (configurable).<LINE>* Rivulet's jump height is significantly decreased (0.8x) (or you can increase it in the config menu).<LINE>* (Rivulet Spoilers:) Taking 5P's Cell no longer extends cycles (by default, taking the Cell doubles or triples cycle length). Instead, it makes precycles much more common, but precycle rain is less dangerous.<LINE>* Rot walls will not pull in Rivulet as hard, making escape more likely.<LINE>(Rivulet just needed minor decreases in movement. However, taking the Cell made gameplay easy in the base campaign. Now you'll have to use its power to rush through the light rain.)<LINE><LINE>Spearmaster:<LINE>* Spearmaster's movement speed has been slightly decreased (0.9x) (configurable).<LINE>* Takes a quarter-pip of food away for every second spear produced (configurable).<LINE>* Growing a spear without any food causes Spearmaster to have Gourmand's exhaustion for a few seconds (configurable).<LINE>* Repeatedly throwing spears (and/or growing them with food) can briefly trigger Gourmand's exhaustion mechanic for a second or two (configurable).<LINE>* Increased the chance of dying instantly to a lizard bite by 50% (configurable).<LINE>* Increased Spearmaster's jump height by ~10% (configurable) to make platforming sections slightly easier and to compensate for the 10% speed decrease.<LINE>* Spearmaster's produced needles now only deal 80% of their former damage (1 damage when thrown by Spearmaster). This makes normal spears still valuable.<LINE>* (Spearmaster's throwing ability can be optionally configured.)<LINE>* (The rate at which Spearmaster grows spears can be optionally configured, but is unchanged by default.)<LINE>(Spearmaster didn't really need any gameplay balancing. The eighth-pip cost is insignificant unless you tend to spam spears, and the exhaustion mechanics are just a fun gimmick to make spamming spear throws slightly harder.)<LINE><LINE>Saint:<LINE>* Saint's tongue produces less upward velocity when being retracted (configurable). This makes Saint's tongue function more like a Grapple Worm.<LINE>* Saint's tongue is now shorter (80% of previous length).<LINE>* Saint cannot lean to the side as far while hanging down from the ceiling.<LINE>* Saint's swinging speed (when grappling using his tongue) is increased by 50%.<LINE>* Saint's tongue can now be aimed precisely using a controller stick.<LINE>* Lanterns swallowed by Saint provide much less heat (0.6x) (configurable). Now it's much better to hold them.<LINE>* The amount of heat provided by external objects is very slightly reduced (0.9x).<LINE>* (The rate at which Saint's temperature changes can be optionally configured.)<LINE>* Saint's \"God Timer\" is slightly reduced (configurable). Its recharge rate is optionally configurable.<LINE>(Saint could basically fly by spamming the jump button. Now his tongue simply functions as an OP Grapple Worm instead of a mode of sustainable flight. Additionally, hoarding 2 lanterns made the hypothermia mechanics irrelevant, so lanterns are now less potent.)<LINE><LINE>If there is anything else that annoys you about the Downpour slugcats that you want balanced, make a suggestion; maybe I'll make the change for you. If your suggestion is based how over-powered the slugcat is in arena mode, mention that in your suggestion.<LINE>And if you complain that my settings aren't severe enough... click on the \"Extreme Settings\" preset.",
  "requirements": ["moreslugcats"],
  "requirements_names": ["More Slugcats Expansion"],
  "tags": ["Game Mechanics", "Campaigns"],
  "checksum_override_version": false
}
